[
    {
        "title":"Ekstraksi Ciri Pada Pengenalan Sistem Isyarat Bahasa Indonesia Berbasis Sensor Flex Dan Accelerometer",
        "abstract":"Ekstraksi ciri dilakukan untuk mendapatkan besaran-besaran yang menunjukkan kekhususan objek yang ingin dikenali. Algoritma ekstraksi ciri yang baik membuat proses klasifikasi lebih efektif dan efisien. Dalam penelitian ini dikembangkan 5 jenis ekstraksi ciri, yang menggunakan pendekatan statistik, kuantisasi atau kombinasi keduanya. Sensor yang digunakan untuk membuat sarung tangan adalah flex sensor untuk mengukur tekukan jari dan accelerometer untuk mengukur gerakan pada sumbu x,y,z. Dari data-data sensor dilakukan ekstraksi ciri yaitu bentuk lekukan jari-jari tangan dan gerakan tangan terhadap sumbu x, y dan z. Vektor ciri yang diperoleh digunakan untuk pengenalan isyarat dengan metode Dynamic Time Warping (DTW) dan Jaurak Euclidian (Euclidian Distance). Data referensi (template) yang paling cocok diukur berdasarkan nilai jarak (distance) yang paling minimum. Pengujian dengan dilakukan menggunakan dataset 1000 data yang terdiri dari 50 kelas (isyarat kata), dimana masing-masing kelas terdiri dari 20 data. Untuk data pengujian diambil 10 data untuk tiap-tiap kelas, dan 10 sisanya sebagai data referensi. Hasil pengujian menunjukkan akurasi tertinggi mencapai 99,6%.",
        "keyword":"",
        "content":"1. Pendahuluan Bahasa isyarat Indonesia merupakan alat komunikasi yang utama bagi penyandang tuna rungu dan tuna wicara di Indonesia. Penyandang tuna rungu/wicara menggunakan penerjemah ataupun tulisan untuk berkomunikasi dengan orang normal. Akan tetapi penerjemah sering mempunyai tarif yang mahal, demikian pula resiko ketergantungan dan kehilangan privasi. Kemajuan di bidang pengenalan pola (pattern recognition) memberi harapan untuk otomatisasi sistem penerjemah gerak isyarat, meskipun banyak kesulitan yang dihadapi sebelum sistem tersebut menjadi kenyataan. Kategori penelitian yang dilakukan, dapat dibedakan menjadi dua yaitu pendekatan berbasis visi komputer (computer vision) [5,6] dan pendekatan berbasis data sensor, [7,8,9]. Pada pendekatan berbasis visi komputer digunakan file (berkas) video yang disimpan sebelumnya atau langsung melalui kamera yang menangkap gerakan bahasa isyarat. Pendekatan berbasis data sensor, dilakukan dengan menggunakan rangkaian sensor yang terintegrasi dengan sarung tangan (glove). Sensor ini menghasilkan besaran listrik yang terukur, untuk mengetahui derajat tekukan jari-jari tangan dan gerakan tangan. Sedangkan metode yang banyak digunakan adalah HMM (Hidden Markov Model) [6,7] dan ANN (Artificial Neural Network) [5,8,9]. Khusus untuk pengenalan bahasa isyarat Indonesia berbasis sensor telah dilakukan penelitian oleh Evita [9] dengan menggunakan metode ANN, dimana data-data yang diolah, diperoleh dari sensor flex, yang meliputi informasi lelukan jari-jari tangan, lekukan pergelangan, lekukan lengan dan lekukan bahu. Pada makalah ini diusulkan metode Dynamic Time Warping (DTW) untuk pengenalan bahasa isyarat Indonesia berbasis sensor. Pada penelitian ini, selain digunakan sensor flex untuk mengetahui informasi bentuk tangan oleh lekukan jari-jari, juga digunakan sensor accelerometer untuk mendapatkan informasi gerakan tangan. DTW merupakan teknik penyelarasan (aligment) data yang bersifat sekuensial (time series). Teknik DTW yang secara umum telah digunakan pada pengenalan suara, tetapi dalam perkembangannya, DTW juga telah diterapkan untuk aplikasi lain, diantaranya untuk pengenalan gerak isyarat (gesture)[1][3], data mining [4] dan verfikasi tanda tangan[2]. 2. Sistem Isyarat Bahasa Indonesia Bahasa isyarat isyarat Indonesia juga dikenal dengan istilah SIBI (Sistem Isyarat Bahasa Indonesia). Komponen isyarat yang utama adalah bentukan jari-jari tangan dan gerakan tangan. Pada sebagian besar isyarat kata, gerakan tangan lebih dominan dan bervariasi dibandingkan dengan bentukan jari-jari tangan. Pada penelitian Evita[9] yang hanya menggunakan sensor flex, akurasi pengenalannya turun drastis dari 83,18% untuk isyarat kata yang statis menjadi 49,58% untuk isyarat kata yang bergerak. Dalam penelitian ini, pengenalan ditujukan untuk isyarat kata bahasa Indonesia, dengan penambahan jenis sensor lain. Dua informasi komponen utama isyarat kata diukur dengan penggunaan sensor flex dan sensor accelerometer yang diintegrasikan dalam bentuk sarung tangan sebagai piranti akusisi data. Gambar 1 menunjukkan diagram blok system pengenalan bahasa isyarat Indonesia . 3. Sensor Sensor yang digunakan adalah sensor flex dan sensor accelerometer. Bentuk fisik sensor flex dan sensor accelerometer diperlihatkan pada Gambar 2. 3.1 Sensor Flex Sensor flex adalah jenis sensor resisif yang berubah nilai resistansinya ketika ada lekukan. Pada kondisi flat (tidak tertekuk), sensor flex mempunyai nilai resistansi 10 KΩ. Nilai resistansinya akan semakin membesar pada saat terjadi tekukan sampai dengan 40 KΩ pada saat tekukan maksimal[10]. Karena jari hanya mempunyai satu derajat kebebasan, maka untuk tiap-tiap jari cukup menggunakan satu sensor flex. 3.2 Sensor Accelerometer Sedangkan sensor accelerometer yang digunakan adalah Hitachi H48C [12] yang merupakan modul sensor buatan Parallax diintegrasi dengan ADC (Analog to Digital Converter) dan regulator tegangan. Accelerometer dapat mendeteksi kemiringan (tilt) dan gerakan (percepatan) pada tiga sumbu x,y,z dengan jangkauan pengukuran maksimal  3g (1ｇ=9.81m/s2), non-linearity 2% dan sensitivity 333 mV/g pada tegangan 3 Volt[9]. Sarung tangan bersensor yang digunakan untuk akuisisi data dapat dilihat pada Gambar 3. 4. Akuisisi Data Tahap ini ditujukan untuk mendapatkan data-data dari sensor untuk kemudian diolah menjadi vektor fitur (feature vector), sebagaimana diperlihatkan Gambar 4. Data-data yang diperoleh dari sensor adalah sebanyak 8 jenis data. Data-data tersebut sebagai berikut: a. derajat tekukan jari jempol b. derajat tekukan jari telunjuk c. derajat tekukan jari tengah d. derajat tekukan jari kelingking e. derajat tekukan jari manis f. gerakan tangan terhadap sumbu x,y,z Kelima data lekukan jari telah dinormalisasi untuk menyamakan perbedaan nilai toleransi dari di antara sensor-sensor flex yang digunakan. Besaran lekukan jari dinormalisasi[16] pada range nilai 0 sampai 20 menggunakan persamaan 1 sebelum disimpan dalam file dataset. Sedangkan untuk besaran akselarasi masih berupa data counting, yang diambil 8-bit MSB (Most Significant Bit) dari 12 bit data counter-nya. Untuk mendapatkan nilai akselerasi yang sebenarnya diperlukan perhitungan khusus yang dijelaskan pada bagian ekstraksi ciri. Contoh data gerak isyarat kata ‘abang’ yang tersimpan pada dalam bentuk file dengam format teks (ibi) pada proses akusisi data diperlihatkan pada tabel 1. Data yang tersimpan adalah data sekuensial, dengan panjang (baris) yang berbeda yang bergantung jenis isyarat kata dan kecepatan gerakan pada saat melakukan isyarat. Pada contoh tabel 1, panjang data isyarat kata ‘adik’ adalah 11. Kolom [1…5] adalah data dari sensor flex untuk lekukan jari jempol sampai dengan jari kelingking, sedangkan [6…9] adalah data dari sensor accelerometer untuk sumbu X, Y, Z dan referensi. Baris [1..11] menunjukkan urutan data diambil/disimpan, yaitu dari awal gerakan isyarat satu kata sampai dengan selesai gerakan isyarat kata tersebut. Gerak isyarat kata bahasa Indonesia yang dilakukan mengacu pada video gerak isyarat yang terdapat pada [11] [13]yang merupakan visualisasi dari kamus sistem isyarat bahasa Indonesia. 5. Metode Pengenalan SIBI 5.1 Jarak Euclidean Jarak Euclidean adalah metode yang paling umum digunankan untuk banyak penerapan untuk mencari derajat kemiripan (similiarity) antara dua data sekuensial (time series). Derajat kemiripan berdasarkan Jarak Euclidean dihitung menggunakan persamaan 2. Metode ini bisa digunakan jika kedua data sekuensial P dan Q mempunyai panjang yang sama. Pada kasus Q dan Q dengan panjang yang tidak sama, maka Jarak Euclidean tidak dapat digunakan. Oleh karena itu diperlukan metode lain yang dapat memetakan elemen Q terhadap elemen Q untuk mendapatkan derajat kemiripan dari dua sekuensial yang memiliki panjang berbeda. 5.2 DTW (Dinamic Time Warping) Gerak isyarat merupakan data sekuensial. Tiap elemen data sekuensial diukur dan disimpan pada satu periode waktu yang tetap antara elemen satu dengan yang berikutnya. Salah satu metode untuk membandingkan dua data sekunesial dengan panjang yang berbeda adalah dengan algoritma Dynamic Time Warping (DTW). Penjelasan algoritma DTW secara lengkap dapat ditemukan pada [13]. DTW merupakan algoritma yang digunakan untuk mengukur kemiripan antara dua sekuensial dengan durasi (panjang) berbeda. DTW mencocokkan dua sekuensial dengan menghitung tranformasi temporal sehingga keduanya dapat diselaraskan (aligned). Penyelarasan (alignment) adalah optimal jika terukur jarak kumulatif terkecil antara dua sampel yang telah diselaraskan. Jika diasumsikan terdapat dua data sekuensial, Q dan C, dengan panjang masing-masing n dan m dengan Maka untuk menyelaraskan (align) kedua sekuensial tersebut mengunakan DTW, dibentuk matriks m x n dengan elemen matriks (i,j) berupa nilai jarak d(qi,cj) antara dua titik qi dan, yaitu d(qi,cj) = (qi– cj)2. Setiap elemen matriks (i,j) berhubungan dengan penyelarasan (alignment) antara titik qi dan cj sebagaimana ditunjukkan pada Gambar 2.8. Warping path W merupakan sekelompok elemen matriks yang berdampingan yang mendefinisikan pemetaan antara Q dan C. Elemen ke-k dari W dirumuskan sebagai wk = (i,j)k, sehingga Sedangkan path didefinisikan sebagai jarak kumulatif D(i,j) yaitu jarak d(qi,cj) untuk elemen tersebut ditambah dengan minimum dari jarak kumulatif dari elemen bertetanggaan (adjacent). Setelah didapatkan warping path yang optimal maka jarak atau warping cost dihitung berdasarkan persamaan 7. 5.3 Perbandingan DTW dan Jarak Euclidean Ilustrasi perbandingan antara metode DTW dan metode Jarak Euclidean pada data sekuensial ditunjukkan pada gambar 2.9, yaitu untuk data sekuensial dengan panjang sama dan panjang berbeda. Untuk panjang data sama, Jarak Euclidean akan memetakan secara sesuai urutan indeks-nya, sehingga dua data sekuensial yang berlainan fasa akan dianggap tidak mirip. Sedangkan untuk panjang data yang berbeda, Jarak Euclidean hanya memetakan sampai dengan indeks data sekuensial yang lebih pendek. 6. Ekstraksi Ciri Ekstraksi ciri dilakukan untuk mendapatkan besaran-besaran yang menunjukkan kekhususan dari data yang diolah. Ekstraksi ciri mempunyai dua tugas yaitu mengubah parameter vektor input menjadi vektor ciri dan/atau reduksi dimensi. Vektor ciri merupakan nilai-nilai hasil pengolahan data-data flex dan data accelerometer yang kemudian diatur sedemikian rupa membentuk baris angka (nilai). Data sensor yang dibaca dari file dibagi menjadi dua bagian data, yaitu data sensor flex dan data accelerometer (Tabel 1). 6.1. Perhitungan yang digunakan 6.1.1 Histogram Histogram merupakan salah satu cara untuk merepresentasikan data dalam bentuk distribusi fekuensi. Histogram dapat dianggap sebagai fungsi kerapatan probabilitas (probability density function) diskrit. Pendekatan histogram untuk ekstraksi ciri digunakan dalam penelitian MC Leu [4]. Dalam penelitian ini, histogram yang digunakan adalah terbagi 10 tingkatan nilai (sub-range) untuk tiap data tekukan jari tangan dan 17 tingkatan nilai untuk tiap sumbu (axis) data akselarasi telapak tangan. 6.1.2 Nilai rata-rata dan nilai simpangan baku Pendekatan statistik sering digunakan sebagai ukuran dalam analisa data, di antranya adalah nilai rata-rata (mean) dan nilai simpangan baku (standard deviation). Jika terdapat data sekuensial Xi dengan i = 1,2,3 …, n dan jika nilai rata-rata dinotasikan sebagai u, maka nilai u dapat dihitung berdasarkan persamaan 8. Sedangkan untuk nilai simpangan baku X yang dalam hal ini dinotasikan sebagai s, maka nilai s dapat dihitung berdasarkan persamaan 9. 6.1.3 Kuantisasi Kuantisasi merupakan proses untuk membatasi semua nilai yang mungkin menjadi jumlah yang terbatas. Kuantisasi yang digunakan dalam penlitian ini adalah kuantisasi non linier, yang dilakukan hanya untuk data akselerasi telapak tangan. Penggunaan kuantisasi untuk akselerasi dilakukan pada penelitian J Liu [7]. Sebelum dilakukan proses kuantisasi, nilai akselerasi yang sebenarnya untuk masing-masing sumbu x, y dan z dihitung terlebih dahulu dengan menggunakan persamaan 3.5 yang mengacu pada datasheet -nya[5]. Jika a sebagai notasi untuk akselarasi, maka ax1 menunjukkan nilai akselarasi untuk sumbu x untuk data pertama (baris pertama dalam file), ay1 untuk nilai akselarasi sumbu y data pertama, az1 untuk nilai akselarasi sumbu z data pertama, ax2 untuk nilai akselarasi sumbu x data kedua, dan seterusnya.Nilai akselerasi a ini relatif kecil terhadap nilai normalisasi lekukan jari, sehingga dilakukan kuantisasi[17],[18] nilai akselarasi a untuk masingmasing sumbu X, Y dan Z berdasarkan Tabel 2. (1ｇ=9.81m/s2). Jika k adalah notasi untuk nilai kuantisasi akselarasi, maka kx1 menunjukkan nilai kuantisasi akselarasi untuk sumbu x untuk data pertama (baris pertama), ky1 untuk nilai kuantisasi akselarasi sumbu y data pertama, kz1 untuk nilai kuantisasi akselarasi sumbu z data pertama, kx2 untuk nilai kuantisasi akselarasi sumbu x data kedua, dan seterusnya. 6.2 Ekstraksi ciri yang digunakan Dalam penelitian ini digunakan 5 jenis ekstraksi ciri, yang menggunakan pendekatan statistik, kuantisasi atau kombinasi keduanya. Untuk membedakan antara jenis ekstraksi ciri yang satu dengan ekstraksi yang lain, masing-masing ekstraksi ciri diberi tambahan label A, B, C, D dan E. 6.2.1 Ekstraksi ciri A Ekstraksi ciri A menggunakan pendekatan statistik yaitu histogram yang digunakan baik untuk data tekukan jari tangan maupun untuk data akselarasi telapak tangan. Untuk data akselarasi telapak tangan, sebelum ditransformasikan ke bentuk histogram maka dilakukan proses kuantisasi. Histogram untuk tiap data tekukan jari dibagai menjadi 10 interval (bagian) sedangkan untuk data akselarasi telapak tangan digunakan 17 interval untuk masing-masing sumbu x, y dan z. Proses ekstraksi ciri A ini menghasilkan vektor ciri dengan panjang yang sama untuk tiap sampel isyarat kata yaitu 101. Oleh karena itu, baik metode Jarak Euclidean maupun DTW bisa digunakan. Bagan alir ekstraksi ciri A diperlihatkan pada Gambar 6. 6.2.2 Ekstraksi ciri B Ekstraksi ciri B menggunakan pendekatan statistik yaitu dengan menghitung nilai rata-rata dan nilai simpangan baku, yang digunakan baik untuk data tekukan jari tangan maupun untuk data akselarasi telapak tangan. Untuk data akselarasi telapak tangan, sebelum ditransformasikan ke bentuk histogram maka dilakukan proses kuantisasi. Proses ekstraksi ciri A ini menghasilkan vektor ciri dengan panjang yang sama untuk tiap sampel isyarat kata yaitu 16. Oleh karena itu, baik metode Jarak Euclidean maupun DTW bisa digunakan. Bagan alir ekstraksi ciri A diperlihatkan pada Gambar 7. 6.2.3 Ekstraksi ciri C Ekstraksi ciri C menggunakan kuantisasi tetapi hanya untuk data akselarasi telapak tangan. Sedangkan untuk data tekukan jari tangan masih bentuk aslinya yang terbaca pada saat proses akusisi data. Proses ekstraksi ciri C ini menghasilkan vektor ciri dengan panjang yang tidak sama untuk tiap sampel isyarat kata, bahkan hal ini juga terjadi untuk sampel isyarat kata dalam satu kelas yang sama karena perbedaan jumlah data yang tersimpan. Kerana memiliki panjang data yang berbeda, maka hanya algoritma DTW bisa digunakan. Bagan alir ekstraksi ciri C diperlihatkan pada Gambar 8. 6.2.4 Ekstraksi ciri D Ekstraksi ciri D menggunakan kuantisasi dan pendekatan statistik yaitu dengan menghitung nilai rata-rata dan nilai simpangan baku, tetapi hanya untuk data akselarasi telapak tangan. Sedangkan untuk data tekukan jari tangan masih bentuk aslinya yang terbaca pada saat proses akusisi data. Proses ekstraksi ciri D ini menghasilkan vektor ciri dengan panjang yang tidak sama untuk tiap sampel isyarat kata, bahkan hal ini juga terjadi untuk sampel isyarat kata dalam satu kelas yang sama karena perbedaan jumlah data yang tersimpan. Kerana memiliki panjang data yang berbeda, maka hanya algoritma DTW bisa digunakan. Bagan alir ekstraksi ciri D diperlihatkan pada Gambar 9. 6.2.5 Ekstraksi ciri E Ekstraksi ciri E menggunakan kuantisasi tetapi hanya untuk data akselarasi telapak tangan. Sedangkan untuk data tekukan jari tangan digunakan pendekatan statistik dengan menghitung nilai ratarata dan nilai simpangan baku. Proses ekstraksi ciri E ini menghasilkan vektor ciri dengan panjang yang tidak sama untuk tiap sampel isyarat kata, bahkan hal ini juga terjadi untuk sampel isyarat kata dalam satu kelas yang sama karena perbedaan jumlah data yang tersimpan. Kerana memiliki panjang data yang berbeda, maka hanya algoritma DTW bisa digunakan. Bagan alir ekstraksi ciri E diperlihatkan pada Gambar 10. 6.3 Vektor Ciri Vektor ciri merupakan barisan data yang merupakan hasil dari proses ekstraksi ciri. Vektor ciri didapatkan dengan cara menderetkan nilai-nilai yang didapatkan dari ekstraksi ciri yang mencakup ciri-ciri untuk tekukan jari dan akselerasi telapak tapak. Panjang data untuk vektor ciri untuk masingmasing ekstraksi ciri adalah bergantung ekstraksi ciri yang digunakan. Ekstraksi ciri A dan B menghasilkan panjang data vektor ciri yang sama untuk tiap sampel dalam data uji, sedangkan ekstraksi C, D dan E menghasilkan panjang data vektor ciri yang berbeda. Contoh hasil ekstraksi ciri E untuk data isyarat kata ’kami’ pada tabel 3.2 yang digambarkan dalam bentuk grafik ditunjukkan pada Gambar 11. Panjang data vektor ciri tersebut adalah 61. 7. Uji Coba dan Pembahasan 7.1 Evaluasi Kinerja Sistem Kinerja sistem pengenalan bahasa isyarat ini dievaluasi menggunakan matriks kebingungan (confusion matrix) [14]. Instrumen yang digunakan untuk mengukur kinerja sistem adalah akurasi (accuracy). 7.2 Pengujian Pertama Menggunakan Metode Jarak Euclidean Pengujian pertama dilakukan untuk mengetahui pengaruh jumlah sampel per kelas data referensi terhadap akurasi dan waktu pengujian. Jumlah sampel yang digunakan adalah 1 sampai dengan 10. Pertama-tama dipilih 1 sampel untuk mewakili tiap kelas dalam data referensi, kemudian dilakukan proses pengenalan untuk semua data pengujian. Setelah dilakukan pencatatan hasil akurasi dan waktu pengujian untuk 500 sampel data pengujian, maka proses pengenalan diulangi lagi dengan menggunakan yang sampel tiap kelas data referensi yang lebih besar yaitu 1, 2, 3 sampai dengan 10. Pengujian I menggunakan metode Jarak Euclidean untuk membandingkan ekstraksi ciri A dan ekstraksi ciri B. Gambar 3 menunjukkan grafik hasil pengujian I sedangkan untuk data hasil pengujian pertama dapat dilihat pada lampiran B. Dari Gambar 3, dengan menggunakan metode Jarak Euclidean, akurasi maksimal dicapai adalah 97,6% dan waktu pengujian minimal 7,797 detik diperoleh dengan menggunakan ekstraksi ciri B. 7.3 Pengujian Kedua Menggunakan Metode DTW Pengujian kedua dilakukan untuk mengetahui pengaruh jumlah sampel per kelas data referensi terhadap akurasi dan waktu pengujian. Jumlah sampel yang digunakan adalah 1 sampai dengan 10. Pertama-tama dipilih 1 sampel untuk mewakili tiap kelas dalam data referensi, kemudian dilakukan proses pengenalan untuk semua data pengujian. Setelah dilakukan pencatatan hasil akurasi dan waktu pengujian, maka proses pengenalan diulangi lagi dengan menggunakan yang sampel tiap kelas data referensi yang lebih besar yaitu 2, 3, 4 sampai dengan 10. Pengujian kedua menggunakan metode DTW untuk membandingkan ekstraksi ciri A, B, C, D dan E. Gambar 4.2 menunjukkan grafik hasil pengujian kedua, sedangkan tabel hasil pengujian kedua dapat dilihat pada lampiran C. Dari Gambar 4, dengan menggunakan metode DTW, akurasi maksimal 99,6% diperoleh dengan menggunakan ekstraksi ciri E, sedangkan untuk waktu pengujian minimal 25.39 detik diperoleh dengan menggunakan ekstraksi ciri B. Gambar 4 (b) yang menunjukkan perbandingan waktu pengujian juga menunjukkan perbandingan panjang vektor ciri yang merupakan hasil ekstraksi ciri. Panjang vektor ciri yang paling panjang adalah vektor ciri A, sedangkan yang paling pendek adalah vektor ciri B. 7.4 Perbandingan Metode Sistem Pengenal dan Ekstraksi Ciri Berdasarkan tabel hasil pengujian pertama dan tabel hasil pengujian kedua pada lampiran B dan lampiran C, maka untuk penggunaan sampel per kelas data referensi terbesar yaitu 10, dapat dibuat tabel perbandingan akurasi dan waktu pengujian untuk masing-masing metode dan ekstraksi ciri yang digunakan sebagaimana ditunjukkan pada Tabel 3. Tabel 3. Perbandingan metode sistem pengenal dan ekstraksi ciri Tabel 3 menunjukkan akurasi tertinggi 99,6% dicapai dengan menggunakan metode DTW dan ekstraksi ciri E, yang menggabungkan pendekatan statistik dan kuantisasi. Perubahan akselarasi telepak tangan yang lebih kompleks dari perubahan tekukan jari selama gerak isyarat kata lebih tepat menggunakan kuantisasi dari pada pendekatan statistik dengan nilai rata-rata dan simpangan baku. Karena dengan pendekatan statistik, informasi urutan perubahan akselarasi telapak tangan akan hilang. Sedangkan waktu pengujian terkecil adalah 7,797 detik yang dicapai menggunakan metode Jarak Euclidean dan ekstraksi ciri B. Ekstraksi ciri B menggunakan pendekatan statistik dengan nilai rata-rata dan simpangan baku menghasilkan vektor ciri dengan panjang terpendek yaitu 16. Selain itu, waktu komputasi Jarak Euclidean lebih cepat dari metode DTW sebagaimana penjelesan sub bab sebelumnya. Nilai akurasi 99,6% dimungkinkan untuk dicapai karena menggunakan data yang diambil dalam jangka waktu yang pendek antara data pengujian dan data referensi, yaitu dalam satu hari secara berurutan, sehingga perbedaan data gerak isyarat kata dalam satu kelas akan relatif kecil. Untuk mendapatkan ukuran kinerja sistem pengenal dengan metode DTW dan ekstraksi ciri E berdasarkan nilai akurasinya, maka dilakukan pengujian keempat untuk mendapatkan nilai akurasi rata-rata, yaitu dengan menggunakan teknik validasi 3-fold cross validation dan dengan menambahkan 10 sampel baru untuk masing-masing kelasnya. 8. Kesimpulan dan Saran 8.1 Kesimpulan 1. Penelitian ini mengembangkan sistem pengenalan bahasa isyarat Indonesia berbasis sensor flex dan accelerometer untuk mengenali 50 isyarat kata (kelas) SIBI (Sistem Isyarat Bahasa Indonesia). 2. Hasil akurasi optimal diperoleh dengan menggunakan metode Dynamic Time Warping (DTW) dengan ekstraksi ciri dengan pendekatan statistik dan kuantisasi. 8.2 Saran Penelitian ini merupakan tahap awal untuk pengembangan penelitian selanjutnya. Dalam peneltian ini masih terbatas pada penggunaaan satu tangan dalam melakukan isyarat dengan jumlah data yang digunakan masih terbatas 50 isyarat kata dan sensor yang digunakan hanya mendeteksi perubahan lekukan jari dan akselarasi telapak tangan terhadap sumbu x, y dan z. Beberapa pengembangan penelitian tentang pengenalan bahasa isyarat Indonesia berbasis sensor antara lain: a. Penggunaan metode lain yang dengan akurasi tinggi, tetapi dengan waktu pengujian yang lebih cepat. Meskipun dengan metode DTW diperoleh akurasi tinggi, tetapi waktu pengujian akan semakin lama jika jumlah referensi yang digunakan semakin besar. b. Penambahan sensor yang digunakan, yaitu 1. sensor untuk mengetahui adanya renggangan antar jari-jari tangan 2. sensor accelerometer untuk mengetahui akselarasi lengan, yang juga bisa digunakan sebagai deteksi start dan stop yang menentukan awal dan akhir gerakan. c. Penggunaan dua tangan d. Penggunaan jumlah data uji dan jumlah kelas yang lebih besar e. Pemisahan isyarat kata pada rangkaian isyarat kata yang membentuk kalimat. f. Penerapan dalam bentuk prototipe alat bantu penerjemah."
    }
]